# photoshop简单使用
## 移动工具
就是可以选择某个或者几个图层，然后就可以使用那些`对齐`的操作

- 这里还需要改为`图层`，这样才能够选到具体的图层
- 这里点上`自动选择`，然后`alt`加左键就可以得到你想要的块的位置，注意如果有最外层的话先隐藏掉

## 选框工具（m）
就是选择某个片段，这里有`加法`选框，`减法`选框，`乘法`选框，还可以使用`椭圆形`选框，`单行`，`单列`。

- 按住`shift`可以强制控制是正方形或者原型
- 按住`shift`再画等于是在做`加法`的选框
- 按住`alt`可以控制圆形圆心的位置
- 按住`alt`再画等于是在做`减法`的选框
- `shift`+`m`可以切换使用哪个形状

## 套索工具
和选框工具差不多，画一个闭合的曲线就可以选择一个范围，还有`多边形`套索，还有神奇的`磁性套索`工具

- 最后的位置双击一下就可以闭合了
- `磁性套索`这个很好用，会自动去吸附在颜色的色差改变的地方

## 快速选择工具
这个也是个很神奇的，直接选择一块的地方，也对应的有加法和减法，这里还与`魔棒`工具合并了

- 这里`[`代表着放大，`]`代表着缩小
- `魔棒`也是很神奇的啊

>选择完选区，填充的时候给个`内容识别`，还可以加上一些内容，不注意还以为没有这个

## 裁剪工具
这个可以选择了区域之后使用裁剪，就可以智能地裁剪最符合的一块

## 吸管工具
可以得到颜色的具体信息

## tip
- 按住`alt`点击眼睛，可以将除了选中之外的全部隐藏了
- 按住`command`点击图层，可以选中响应的工作区




